# Ввод - вывод

print(1)
print("Hello")
print("Привет", "меня зовут", "Слава")
# Перенос строки
print("Мороз и солнце\nДень чудесный")
Табуляция
print("1\t2\t3")
print("1"+"   "+"2"+"   "+"3")

# Ввод

message = input("Введите ваше сообщение: ")
print("Вы: "+ message)


#Переменная

# Область памяти, у которой есть имя,
# и содержимое которой мы можем
# использовать в нашей программе.

variable1 = 100
variable1 = 250
variable1 = "Группа ПП-1 лучшая группа на свете"
print(variable1)

# Потренируйтесь в создании переменных

# Первая пусть хранит имя,
# что пользователь введет через input()

# Вторая пусть хранит текущее время (строка)

# Третья - ваш возраст (целое число)

# выведите содержимое переменных


name = input("Введите свое имя: ")
time = "16:26"
age = 26
print("Твое имя:",name,"\nСейчас ",time,"\nТебе",age,"лет")


text_var="Какой-то текст" #строка
int_num_var = 20 #Целочисленная переменная
float_num_var = 11.1 #Число с точкой
boolean_var = True #логическая (True/False)


# Динамическая типизация
color = "blue"
print(color)
color = (0,0,255) #кортеж тип данных
print(color)


#Арифметика

num1 = 20
num2 = 9

print(num1+num2) # Сумма
print(num1-num2) # Разность
print(num1*num2) # Умножение
print(num1/num2) # Деление

print(2+2-10*10/30)

print(num1//num2) # Целочисленное деление (7/2 = 3)
print(num1**num2) # Возведение в степень
print(num1%num2) # Остаток от деления

number = 10
number = 15
number+=5 #number = number + 5
number-=5 #number = number - 5
number*=5 #number = number * 5
number/=5 #number = number / 5
print(number)







print(1) #вывод в консоль
message = input("введите текст: ") #Ввод в программу данных
#Типы переменных
age=16 #Переменная типа int(целое число)
mass = 100.0 #float
name = "Василий" #string
is_computer_on = True #переменная логического типа (bool) True/False

#f-строки

auto = "VAZ"
color = "red"
max_speed = 150
mass = 1500.10
model = "Классический"
defence = True
engine_v = 1.6

print(f"Поздравляем с приобретением автомобиля {auto} цвет: {color} максимальная скорость {max_speed} масса: {mass}")
print(f"Комплектация {model}, сигнализация {True}, Объем двигателя: {engine_v}")

# Добавьте переменную о комплектации ("Бюджет", "Классический", "Люкс")
# Добавьте переменную о наличии сигнализации (используйте логический тип)
# Добавьте переменную характеризующую объем двигателя (число 1.6 например)
# Добавьте к сообщению вывод этих переменных












